In [16]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn.preprocessing import LabelEncoder
from sklearn.tree import DecisionTreeClassifier

## ---------------------------------------------------------------------------------------------

## 1.

In [3]:
df=pd.read_csv('salaries.csv')

In [4]:
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                16 non-null     object
 1   job                    16 non-null     object
 2   degree                 16 non-null     object
 3   salary_more_then_100k  16 non-null     int64
dtypes: int64(1), object(3)
memory usage: 640.0+ bytes

In [6]:
inp=df.iloc[:,0:3]
ter=df.iloc[:,-1]
print(inp)
print(ter)

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters
0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [7]:
le_com=LabelEncoder()
le_job=LabelEncoder()
le_deg=LabelEncoder()

In [8]:
inp['com']=le_com.fit_transform(inp['company'])
inp['jo']=le_job.fit_transform(inp['job'])
inp['deg']=le_deg.fit_transform(inp['degree'])

In [9]:
inp.head()

  company                  job     degree  com  jo  deg
0  google      sales executive  bachelors    2   2    0
1  google      sales executive    masters    2   2    1
2  google     business manager  bachelors    2   0    0
3  google     business manager    masters    2   0    1
4  google  computer programmer  bachelors    2   1    0

In [14]:
inp=inp.drop(['company','job','degree'],axis='columns')

In [15]:
inp.head()

   com  jo  deg
0    2   2    0
1    2   2    1
2    2   0    0
3    2   0    1
4    2   1    0

In [18]:
x_train,x_test,y_train,y_test=train_test_split(inp,ter,train_size=0.8,random_state=2)

In [20]:
y_train

9     1
3     1
1     0
10    1
7     0
14    1
2     1
11    1
6     0
15    1
13    1
8     0
Name: salary_more_then_100k, dtype: int64

In [21]:
mod=DecisionTreeClassifier()

In [23]:
mod.fit(x_train,y_train)

DecisionTreeClassifier()

In [24]:
mod.score(x_train,y_train)

1.0

In [25]:
mod.score(x_test,y_test)

0.75

In [26]:
mod.predict([[2,2,1]])

array([0], dtype=int64)

## --------------------------------------------------------------------------------------------------------

## 2.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.tree import DecisionTreeClassifier

In [2]:
df=pd.read_csv('titanic_dt.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.shape

(891, 12)

In [7]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)

In [8]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [9]:
inp=df.drop('Survived',axis=1)
ter=df['Survived']

In [10]:
inp.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [11]:
ter.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [12]:
le=LabelEncoder()
inp['le_sex']=le.fit_transform(inp.Sex)

In [13]:
inp.head()

   Pclass     Sex   Age     Fare  le_sex
0       3    male  22.0   7.2500       1
1       1  female  38.0  71.2833       0
2       3  female  26.0   7.9250       0
3       1  female  35.0  53.1000       0
4       3    male  35.0   8.0500       1

In [14]:
inp=inp.drop('Sex',axis=1)

In [15]:
inp.head()

   Pclass   Age     Fare  le_sex
0       3  22.0   7.2500       1
1       1  38.0  71.2833       0
2       3  26.0   7.9250       0
3       1  35.0  53.1000       0
4       3  35.0   8.0500       1

In [16]:
inp.isnull().sum()

Pclass      0
Age       177
Fare        0
le_sex      0
dtype: int64

In [17]:
inp['Age'].mean()

29.69911764705882

In [26]:
inp['Age'].fillna(inp['Age'].mean(),inplace=True)

In [27]:
inp['Age'].isnull().sum()

0

In [28]:
inp.isnull().sum()

Pclass    0
Age       0
Fare      0
le_sex    0
dtype: int64

In [29]:
x_train,x_test,y_train,y_test=train_test_split(inp,ter,train_size=0.8,random_state=2)

In [30]:
x_train

     Pclass        Age      Fare  le_sex
30        1  40.000000   27.7208       1
10        3   4.000000   16.7000       0
873       3  47.000000    9.0000       1
182       3   9.000000   31.3875       1
876       3  20.000000    9.8458       1
..      ...        ...       ...     ...
534       3  30.000000    8.6625       0
584       3  29.699118    8.7125       1
493       1  71.000000   49.5042       1
527       1  29.699118  221.7792       1
168       1  29.699118   25.9250       1

[712 rows x 4 columns]

In [31]:
df.shape

(891, 5)

In [32]:
model=DecisionTreeClassifier()
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [33]:
model.score(x_train,y_train)

0.9845505617977528

In [34]:
model.score(x_test,y_test)

0.7653631284916201